jmeter/transaction-service-report/statistics.json
{
  "Delete Transaction" : {
    "transaction" : "Delete Transaction",
    "sampleCount" : 250,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.02,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 16.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.0,
    "pct3ResTime" : 9.980000000000018,
    "throughput" : 272.92576419213975,
    "receivedKBytesPerSec" : 67.69838291484716,
    "sentKBytesPerSec" : 103.14674877183405
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.5249999999999995,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 29.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 11.0,
    "throughput" : 1047.1204188481674,
    "receivedKBytesPerSec" : 644.9914103403141,
    "sentKBytesPerSec" : 322.62352748691103
  },
  "Create Transaction" : {
    "transaction" : "Create Transaction",
    "sampleCount" : 250,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.8760000000000001,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 17.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 11.0,
    "throughput" : 270.85590465872156,
    "receivedKBytesPerSec" : 77.76526950162513,
    "sentKBytesPerSec" : 101.3064565276273
  },
  "Update Transaction" : {
    "transaction" : "Update Transaction",
    "sampleCount" : 250,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.232,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 16.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 2.4499999999999886,
    "pct3ResTime" : 7.4500000000000455,
    "throughput" : 272.0348204570185,
    "receivedKBytesPerSec" : 149.3003604461371,
    "sentKBytesPerSec" : 79.69770130576714
  },
  "Query Transactions" : {
    "transaction" : "Query Transactions",
    "sampleCount" : 250,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.972,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 29.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 29.0,
    "throughput" : 262.60504201680675,
    "receivedKBytesPerSec" : 362.36418395483196,
    "sentKBytesPerSec" : 49.23844537815126
  }
}